Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMDA1_DFP/2.7.82/edc/ATSAMDA1G14B.PIC
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="SCALER1" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x42004421">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x6" edc:desc="Scaler Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3DE" edc:_addr="0x42004422"/>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x42004800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="nn-nnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xDF" edc:_addr="0x42004801">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="EOEN" edc:nzwidth="0x1" edc:desc="External Output Enable"/>
            <edc:SFRFieldDef edc:cname="IOEN" edc:nzwidth="0x1" edc:desc="Internal Output Enable"/>
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:nzwidth="0x1" edc:desc="Left Adjusted Data"/>
            <edc:SFRFieldDef edc:cname="VPD" edc:nzwidth="0x1" edc:desc="Voltage Pump Disable"/>
            <edc:SFRFieldDef edc:cname="BDWP" edc:nzwidth="0x1" edc:desc="Bypass DATABUF Write Protection"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="REFSEL" edc:nzwidth="0x2" edc:desc="Reference Selection">
              <edc:SFRFieldSemantic edc:cname="INT1V" edc:desc="Internal 1.0V reference" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AVCC" edc:desc="AVCC" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="VREFP" edc:desc="External reference" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x42004802">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="STARTEI" edc:nzwidth="0x1" edc:desc="Start Conversion Event Input"/>
            <edc:SFRFieldDef edc:cname="EMPTYEO" edc:nzwidth="0x1" edc:desc="Data Buffer Empty Event Output"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x42004803"/>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x42004804">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN" edc:nzwidth="0x1" edc:desc="Underrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EMPTY" edc:nzwidth="0x1" edc:desc="Data Buffer Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SYNCRDY" edc:nzwidth="0x1" edc:desc="Synchronization Ready Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x42004805">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN" edc:nzwidth="0x1" edc:desc="Underrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EMPTY" edc:nzwidth="0x1" edc:desc="Data Buffer Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SYNCRDY" edc:nzwidth="0x1" edc:desc="Synchronization Ready Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x42004806">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN" edc:nzwidth="0x1" edc:desc="Underrun"/>
            <edc:SFRFieldDef edc:cname="EMPTY" edc:nzwidth="0x1" edc:desc="Data Buffer Empty"/>
            <edc:SFRFieldDef edc:cname="SYNCRDY" edc:nzwidth="0x1" edc:desc="Synchronization Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="r-------" edc:por="00000000" edc:mclr="00000000" edc:impl="0x80" edc:_addr="0x42004807">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SYNCBUSY" edc:nzwidth="0x1" edc:desc="Synchronization Busy Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="DATA" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x42004808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Data value to be converted"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4200480A"/>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="DATABUF" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x4200480C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATABUF" edc:nzwidth="0x10" edc:desc="Data Buffer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x7F2" edc:_addr="0x4200480E"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x42005000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="CKEN0" edc:nzwidth="0x1" edc:desc="Clock Unit 0 Enable"/>
            <edc:SFRFieldDef edc:cname="CKEN1" edc:nzwidth="0x1" edc:desc="Clock Unit 1 Enable"/>
            <edc:SFRFieldDef edc:cname="SEREN0" edc:nzwidth="0x1" edc:desc="Serializer 0 Enable"/>
            <edc:SFRFieldDef edc:cname="SEREN1" edc:nzwidth="0x1" edc:desc="Serializer 1 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x42005001"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="CLKCTRL0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnn-n---nn--nnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFD19FF" edc:_addr="0x42005004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="SLOTSIZE" edc:nzwidth="0x2" edc:desc="Slot Size">
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBSLOTS" edc:nzwidth="0x3" edc:desc="Number of Slots in Frame"/>
            <edc:SFRFieldDef edc:cname="FSWIDTH" edc:nzwidth="0x2" edc:desc="Frame Sync Width">
              <edc:SFRFieldSemantic edc:cname="SLOT" edc:desc="Frame Sync Pulse is 1 Slot wide (default for I2S protocol)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Frame Sync Pulse is half a Frame wide" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BIT" edc:desc="Frame Sync Pulse is 1 Bit wide" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BURST" edc:desc="Clock Unit n operates in Burst mode, with a 1-bit wide Frame Sync pulse per Data sample, only when Data transfer is requested" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BITDELAY" edc:nzwidth="0x1" edc:desc="Data Delay from Frame Sync">
              <edc:SFRFieldSemantic edc:cname="LJ" edc:desc="Left Justified (0 Bit Delay)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="I2S" edc:desc="I2S (1 Bit Delay)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FSSEL" edc:nzwidth="0x1" edc:desc="Frame Sync Select">
              <edc:SFRFieldSemantic edc:cname="SCKDIV" edc:desc="Divided Serial Clock n is used as Frame Sync n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FSPIN" edc:desc="FSn input pin is used as Frame Sync n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FSINV" edc:nzwidth="0x1" edc:desc="Frame Sync Invert"/>
            <edc:SFRFieldDef edc:cname="SCKSEL" edc:nzwidth="0x1" edc:desc="Serial Clock Select">
              <edc:SFRFieldSemantic edc:cname="MCKDIV" edc:desc="Divided Master Clock n is used as Serial Clock n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SCKPIN" edc:desc="SCKn input pin is used as Serial Clock n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MCKSEL" edc:nzwidth="0x1" edc:desc="Master Clock Select">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK_I2S_n is used as Master Clock n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MCKPIN" edc:desc="MCKn input pin is used as Master Clock n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKEN" edc:nzwidth="0x1" edc:desc="Master Clock Enable"/>
            <edc:SFRFieldDef edc:cname="MCKDIV" edc:nzwidth="0x5" edc:desc="Master Clock Division Factor"/>
            <edc:SFRFieldDef edc:cname="MCKOUTDIV" edc:nzwidth="0x5" edc:desc="Master Clock Output Division Factor"/>
            <edc:SFRFieldDef edc:cname="FSOUTINV" edc:nzwidth="0x1" edc:desc="Frame Sync Output Invert"/>
            <edc:SFRFieldDef edc:cname="SCKOUTINV" edc:nzwidth="0x1" edc:desc="Serial Clock Output Invert"/>
            <edc:SFRFieldDef edc:cname="MCKOUTINV" edc:nzwidth="0x1" edc:desc="Master Clock Output Invert"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="CLKCTRL1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnn-n---nn--nnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFD19FF" edc:_addr="0x42005008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="SLOTSIZE" edc:nzwidth="0x2" edc:desc="Slot Size">
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBSLOTS" edc:nzwidth="0x3" edc:desc="Number of Slots in Frame"/>
            <edc:SFRFieldDef edc:cname="FSWIDTH" edc:nzwidth="0x2" edc:desc="Frame Sync Width">
              <edc:SFRFieldSemantic edc:cname="SLOT" edc:desc="Frame Sync Pulse is 1 Slot wide (default for I2S protocol)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Frame Sync Pulse is half a Frame wide" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BIT" edc:desc="Frame Sync Pulse is 1 Bit wide" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BURST" edc:desc="Clock Unit n operates in Burst mode, with a 1-bit wide Frame Sync pulse per Data sample, only when Data transfer is requested" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BITDELAY" edc:nzwidth="0x1" edc:desc="Data Delay from Frame Sync">
              <edc:SFRFieldSemantic edc:cname="LJ" edc:desc="Left Justified (0 Bit Delay)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="I2S" edc:desc="I2S (1 Bit Delay)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FSSEL" edc:nzwidth="0x1" edc:desc="Frame Sync Select">
              <edc:SFRFieldSemantic edc:cname="SCKDIV" edc:desc="Divided Serial Clock n is used as Frame Sync n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FSPIN" edc:desc="FSn input pin is used as Frame Sync n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FSINV" edc:nzwidth="0x1" edc:desc="Frame Sync Invert"/>
            <edc:SFRFieldDef edc:cname="SCKSEL" edc:nzwidth="0x1" edc:desc="Serial Clock Select">
              <edc:SFRFieldSemantic edc:cname="MCKDIV" edc:desc="Divided Master Clock n is used as Serial Clock n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SCKPIN" edc:desc="SCKn input pin is used as Serial Clock n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MCKSEL" edc:nzwidth="0x1" edc:desc="Master Clock Select">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK_I2S_n is used as Master Clock n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MCKPIN" edc:desc="MCKn input pin is used as Master Clock n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKEN" edc:nzwidth="0x1" edc:desc="Master Clock Enable"/>
            <edc:SFRFieldDef edc:cname="MCKDIV" edc:nzwidth="0x5" edc:desc="Master Clock Division Factor"/>
            <edc:SFRFieldDef edc:cname="MCKOUTDIV" edc:nzwidth="0x5" edc:desc="Master Clock Output Division Factor"/>
            <edc:SFRFieldDef edc:cname="FSOUTINV" edc:nzwidth="0x1" edc:desc="Frame Sync Output Invert"/>
            <edc:SFRFieldDef edc:cname="SCKOUTINV" edc:nzwidth="0x1" edc:desc="Serial Clock Output Invert"/>
            <edc:SFRFieldDef edc:cname="MCKOUTINV" edc:nzwidth="0x1" edc:desc="Master Clock Output Invert"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="INTENCLR" edc:nzwidth="0x10" edc:access="--nn--nn--nn--nn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3333" edc:_addr="0x4200500C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="RXRDY0" edc:nzwidth="0x1" edc:desc="Receive Ready 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXRDY1" edc:nzwidth="0x1" edc:desc="Receive Ready 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR0" edc:nzwidth="0x1" edc:desc="Receive Overrun 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOR1" edc:nzwidth="0x1" edc:desc="Receive Overrun 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:nzwidth="0x1" edc:desc="Transmit Ready 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:nzwidth="0x1" edc:desc="Transmit Ready 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXUR0" edc:nzwidth="0x1" edc:desc="Transmit Underrun 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXUR1" edc:nzwidth="0x1" edc:desc="Transmit Underrun 1 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4200500E"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="INTENSET" edc:nzwidth="0x10" edc:access="--nn--nn--nn--nn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3333" edc:_addr="0x42005010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="RXRDY0" edc:nzwidth="0x1" edc:desc="Receive Ready 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXRDY1" edc:nzwidth="0x1" edc:desc="Receive Ready 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR0" edc:nzwidth="0x1" edc:desc="Receive Overrun 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOR1" edc:nzwidth="0x1" edc:desc="Receive Overrun 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:nzwidth="0x1" edc:desc="Transmit Ready 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:nzwidth="0x1" edc:desc="Transmit Ready 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXUR0" edc:nzwidth="0x1" edc:desc="Transmit Underrun 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXUR1" edc:nzwidth="0x1" edc:desc="Transmit Underrun 1 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
